blueskycoco/rtt/bsp/stm32f40x/drivers/k9f1g08_mtd.c
  FSMC_NANDInit(&FSMC_NANDInitStructure);

  /*!使能FSMC BANK2 */
  FSMC_NANDCmd(FSMC_Bank2_NAND, ENABLE);
}
/*******************复位**********************************************/
uint32_t NAND_Reset(void)
{
  *(__IO uint8_t *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_RESET;

  return (NAND_READY);
}
/******************读取ID****************************************/
void NAND_ReadID(NAND_IDTypeDef* NAND_ID)
{
  uint32_t data = 0;
 
  *(__IO uint8_t *)(Bank_NAND_ADDR | CMD_AREA) = 0x90;
	
  *(__IO uint8_t *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;

  data = *(__IO uint32_t *)(Bank_NAND_ADDR | DATA_AREA);

   NAND_ID->Maker_ID   = ADDR_1st_CYCLE (data);
   NAND_ID->Device_ID  = ADDR_2nd_CYCLE (data);
   NAND_ID->Third_ID   = ADDR_3rd_CYCLE (data);
   NAND_ID->Fourth_ID  = ADDR_4th_CYCLE (data);
}
/**********************装载数据***********************************/
void Fill_Buffer(uint8_t *pBuffer, u16 BufferLenght,uint32_t Offset)
{
  u16 IndexTmp = 0;

  /* Put in global buffer same values */
  for (IndexTmp = 0; IndexTmp < BufferLenght; IndexTmp++ )
  {
    pBuffer[IndexTmp] = IndexTmp + Offset;
  }
}
/**********************块擦出*****************************/
uint32_t FSMC_NAND_EraseBlock(NAND_ADDRESS Address)
{
  *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_ERASE0;
  
  *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(ROW_ADDRESS);  
  *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(ROW_ADDRESS);  
  *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_3rd_CYCLE(ROW_ADDRESS);
  		
  *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_ERASE1; 

    while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );
  
    return (FSMC_NAND_GetStatus());
}
uint32_t FSMC_NAND_GetStatus(void)
{
  uint32_t timeout = 0x1000000, status = NAND_READY;

  status = FSMC_NAND_ReadStatus(); 

  /* Wait for a NAND operation to complete or a TIMEOUT to occur */
  while ((status != NAND_READY) &&( timeout != 0x00))
  {
     status = FSMC_NAND_ReadStatus();
     timeout --;      
  }

  if(timeout == 0x00)
  {          
    status =  NAND_TIMEOUT_ERROR;      
  } 

  /* Return the operation status */
  return (status);      
}
uint32_t  FSMC_NAND_ReadStatus(void)
{
  uint32_t data = 0x00, status = NAND_BUSY;

  /* Read status operation ------------------------------------ */
  *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_STATUS;
  data = *(vu8 *)(Bank_NAND_ADDR);

  if((data & NAND_ERROR) == NAND_ERROR)
  {
    status = NAND_ERROR;
  } 
  else if((data & NAND_READY) == NAND_READY)
  {
    status = NAND_READY;
  }
  else
  {
    status = NAND_BUSY; 
  }
  
  return (status);
}
uint32_t FSMC_NAND_WriteSmallPage(uint8_t *pBuffer, NAND_ADDRESS Address, uint32_t NumPageToWrite)
{
   uint32_t index = 0x00, numpagewritten = 0x00, addressstatus = NAND_VALID_ADDRESS;
   uint32_t status = NAND_READY, size = 0x00;

  while((NumPageToWrite != 0x00) && (addressstatus == NAND_VALID_ADDRESS) && (status == NAND_READY))
  {
    /* Page write command and address */
    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM;

    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;  
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0X00; 
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(ROW_ADDRESS);  
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(ROW_ADDRESS); 
  	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_3rd_CYCLE(ROW_ADDRESS); 

    /* Calculate the size */
    size = NAND_PAGE_SIZE + (NAND_PAGE_SIZE * numpagewritten);

    /* Write data */
    for(; index < size; index++)
    {
      *(vu8 *)(Bank_NAND_ADDR | DATA_AREA) = pBuffer[index];
    }
    
    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM_TRUE;
    //
    while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );
    
    /* Check status for successful operation */
    status = FSMC_NAND_GetStatus();
     
    if(status == NAND_READY)
    {
      numpagewritten++;
      NumPageToWrite--;
      /* Calculate Next small page Address */
      addressstatus = FSMC_NAND_AddressIncrement(&Address);    
    }    
  }
  
  return (status | addressstatus);
}
uint32_t FSMC_NAND_ReadSmallPage(uint8_t *pBuffer1, NAND_ADDRESS Address,uint8_t NumPageToRead)
{
  uint32_t index = 0x0000, addressstatus = NAND_VALID_ADDRESS;
  uint32_t status = NAND_READY;
	uint32_t size = 0;
	
	uint8_t numpageread = 0x00;

// while((NumPageToRead != 0x0) && (addressstatus == NAND_VALID_ADDRESS))
  {	   
 //  /* Page Read command and page address 
    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_1; 
   
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00; 
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0X00; 
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(ROW_ADDRESS);  
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(ROW_ADDRESS);  
	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_3rd_CYCLE(ROW_ADDRESS);     

    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_TRUE; 

   while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );    
  //  /* Calculate the size 
    size = NAND_PAGE_SIZE + (NAND_PAGE_SIZE * numpageread);

 //   /* Get Data into Buffer    
    for(; index < size; index++)
    {
      pBuffer1[index]= *(vu8 *)(Bank_NAND_ADDR);
    }
    
    numpageread++;
    
    NumPageToRead--;

  //  /* Calculate page address            			 
    addressstatus = FSMC_NAND_AddressIncrement(&Address);
 }

 status = FSMC_NAND_GetStatus();
 	 
  return (status | addressstatus);
}
uint32_t FSMC_NAND_AddressIncrement(NAND_ADDRESS* Address)
{
 uint32_t status = NAND_VALID_ADDRESS;
 
  Address->Page++;

  if(Address->Page == NAND_BLOCK_SIZE)
  {
    Address->Page = 0;
    Address->Block++;
    
    if(Address->Block == NAND_ZONE_SIZE)
    {
      Address->Block = 0;
      Address->Zone++;

      if(Address->Zone == NAND_MAX_ZONE)
      {
        status = NAND_INVALID_ADDRESS;
      }
    }
  } 
  
  return (status);
}

#define NAND_END_BLOCK 1025

/* configurations */
#define PAGE_DATA_SIZE                  512
#define BLOCK_MARK_SPARE_OFFSET         4
static struct rt_mutex nand;
#if 0
/* nand flash commands. This appears to be generic across all NAND flash chips */
#define CMD_READ			0x00	//  Read
#define CMD_READ1			0x01	//  Read1
#define CMD_READ2			0x50	//  Read2
#define CMD_READID			0x90	//  ReadID
#define CMD_WRITE1			0x80	//  Write phase 1
#define CMD_WRITE2			0x10	//  Write phase 1
#define CMD_ERASE1			0x60	//  Erase phase 1
#define CMD_ERASE2			0xd0	//  Erase phase 1
#define CMD_STATUS			0x70	//  Status read
#define CMD_RESET			0xff	//  Reset

#define NF_CMD(cmd)			{*(volatile rt_uint8_t *)0x02000002 = (cmd); }
#define NF_ADDR(addr)		{*(volatile rt_uint8_t *)0x02000004 = (addr); }	
#define NF_CE_L()			{PDATC = PDATC & ~(1<<9) ; }
#define NF_CE_H()			{PDATC = PDATC | (1<<9) ; }
#define NF_RDDATA()			(*(volatile rt_uint8_t *)0x02000000)
#define NF_RDDATA8()		(*(volatile rt_uint8_t *)0x02000000)
#define NF_WRDATA(data)		{*(volatile rt_uint8_t *)0x02000000 = (data); }
#define NF_WRDATA8(data)	{*(volatile rt_uint8_t *)0x02000000 = (data); } 
#define NF_WAITRB()			{while(!(PDATC&(1<<8)));} 
#define STATUS_READY        0x40    // ready
#define STATUS_ERROR        0x01    // error
#define	STATUS_ILLACC       0x08    // illegal access
/*	add for nor flash 2012-12-11	*/

#ifndef RT_USING_MTD_NOR
#define NOR_START_BLOCK 10
#define NOR_SPARE_BLOCK 1982464//1990656
#define	CHECK_DELAY	150000
#define ROM_BASE 0x00000000
#define toogle_addr(r)	((r))
rt_base_t	baset;

#define inportw(r) 		(*(volatile rt_uint16_t *)(r))
#define outportw(r, d) 	(*(volatile rt_uint16_t *)(d) = r)

static void SWPIDExit(void)
{
    outportw(0x00aa, ROM_BASE+0xaaaa);
    outportw(0x0055, ROM_BASE+0x5554);
    outportw(0x00f0, ROM_BASE+0xaaaa);
}
static void SWPIDEntry(void)
{
    outportw(0x00aa, ROM_BASE+0xaaaa);
    outportw(0x0055, ROM_BASE+0x5554);
    outportw(0x0090, ROM_BASE+0xaaaa);
}
/* RT-Thread MTD device interface */
static rt_uint8_t check_toggle_ready(rt_uint32_t dst)
{
	rt_int16_t PreData,CurrData;
	rt_uint32_t TimeOut=0;

