blueskycoco/rtt/bsp/stm32f40x/drivers/k9f1g08_mtd.c
	PreData = inportw(dst);
	PreData = PreData & 0x0040;
	while(TimeOut < CHECK_DELAY)
	{
		CurrData = inportw(dst);
		CurrData = CurrData & 0x0040;
		if(CurrData == PreData)
		{
			rt_hw_interrupt_enable(baset);
			return RT_EOK;
		}
		else
		{
			PreData = CurrData;
			TimeOut++;
		}
	}
	rt_hw_interrupt_enable(baset);
	return RT_ERROR;
}
static rt_uint8_t SectorErase(rt_uint32_t sector)
{
	baset=rt_hw_interrupt_disable();
	outportw(0xaaaa, ROM_BASE+0xaaaa);
	outportw(0x5555, ROM_BASE+0x5554);
	outportw(0x8080, ROM_BASE+0xaaaa);
	outportw(0xaaaa, ROM_BASE+0xaaaa);
	outportw(0x5555, ROM_BASE+0x5554);
	outportw(0x3030, ROM_BASE+sector);	
	return check_toggle_ready(ROM_BASE+sector);
}

static int FlashProg(rt_uint32_t ProgStart, rt_uint16_t *DataPtr, rt_uint32_t WordCnt)
{	

	for( ; WordCnt; ProgStart+=2, DataPtr++, WordCnt--) {
		baset=rt_hw_interrupt_disable();
		outportw(0xaaaa, ROM_BASE+0xaaaa);
		outportw(0x5555, ROM_BASE+0x5554);
		outportw(0xa0a0, ROM_BASE+0xaaaa);
		outportw(*DataPtr, ROM_BASE+ProgStart);

		if(check_toggle_ready(ROM_BASE+ProgStart)!=RT_EOK)
		{
			return RT_ERROR;
		}

	}
	return RT_EOK;
}

static rt_err_t sst39vf_mtd_check_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	//for nor flash ,there is no bad block	
	rt_uint32_t spare_offs = ((block - NAND_END_BLOCK)/8)*4*1024 + NOR_SPARE_BLOCK;
    rt_uint32_t index = ((block-NAND_END_BLOCK)%8)*512;
	return (*(volatile rt_uint8_t *)(spare_offs+index+4)==0xff) ? RT_EOK:RT_ERROR;
}

static rt_err_t sst39vf_mtd_mark_bad_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	rt_uint32_t spare_offs = ((block - NAND_END_BLOCK)/8)*4*1024 + NOR_SPARE_BLOCK;
    rt_uint32_t index = ((block-NAND_END_BLOCK)%8)*512;
	rt_uint16_t mark = 0xff00;
    if(FlashProg(spare_offs+index+4,&mark,1)!=RT_EOK)
	{
	    rt_kprintf("Prog spare %x failed,offs %d to %d\n",spare_offs,index+512,4096);
	    return RT_ERROR;
	}
    
    return RT_EOK;
}

static rt_err_t sst39vf_mtd_erase_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	//step1 get offset of sst39vf's sector position 1 block need 4 real nor sectors to store
	rt_uint32_t block_offs=(block-NAND_END_BLOCK)*4*4*1024+NOR_START_BLOCK*64*1024;//offs of sst39vf1601, form block 10 ,then to sector address
	rt_uint32_t i;
	//step2 erase 4 sector(one sector is 4k byte, nand's 1 block = 32 page = 32*512 byte = 4 sector, so we need erase 4 sector at a time )
	for(i=0;i<4;i++)
	{
		if(SectorErase(block_offs & ~0xfff)!=RT_EOK) 
		{	//4K Bytes boudary
			rt_kprintf("erase nor block %d failed\n",block_offs/(32*512));
			return RT_ERROR;
		}
		block_offs=block_offs+4096;
	}
	//step3 update spare area at the last 10 sectors 16 bytes to 0xff
	/*read back spare data, 1 sector is enough*/
	rt_uint32_t spare_offs = ((block - NAND_END_BLOCK)/8)*4*1024 + NOR_SPARE_BLOCK;
	rt_uint8_t *spare_buf=(rt_uint8_t *)rt_malloc(4096);
	rt_memcpy(spare_buf,(rt_uint8_t *)spare_offs,4096);
	/*erase this sector*/
	if(SectorErase(spare_offs&~0xfff)==RT_EOK)
	{		
        rt_uint32_t index = ((block-NAND_END_BLOCK)%8)*512;
		rt_kprintf("Erase spare %x ,offs %x\n",spare_offs,index);
        if(index==0)
        {
	        if(FlashProg(spare_offs+512,(rt_uint16_t *)(spare_buf+512),1792)!=RT_EOK)
	        {
		        rt_kprintf("Prog spare %x failed,offs %d to %d\n",spare_offs,index+512,4096);
		        rt_free(spare_buf);
		        return RT_ERROR;
	        }
            
        }
        else if(index==3584)
        {
	        if(FlashProg(spare_offs,(rt_uint16_t *)spare_buf,1792)!=RT_EOK)
	        {
		        rt_kprintf("Prog spare %x failed,offs %d to %d\n",spare_offs,0,3584);
		        rt_free(spare_buf);
		        return RT_ERROR;
	        }

        }
        else
        {
	        if(FlashProg(spare_offs,(rt_uint16_t *)spare_buf,index/2)!=RT_EOK)
	        {
		        rt_kprintf("Prog spare %x failed,offs %d to %d\n",spare_offs,0,index);
		        rt_free(spare_buf);
		        return RT_ERROR;
	        }
            
	        if(FlashProg(spare_offs+index+512,(rt_uint16_t *)(spare_buf+index+512),(3584-index)/2)!=RT_EOK)
	        {
		        rt_kprintf("Prog spare %x failed,offs %d to %d\n",spare_offs,0,3584);
		        rt_free(spare_buf);
		        return RT_ERROR;
	        }

        }

	}
    else
	{
		rt_kprintf("erase nor block %d failed,secotr %d\n",spare_offs/(64*1024),(block-NAND_END_BLOCK)/8);
		rt_free(spare_buf);
		return RT_ERROR;
	}
	//rt_kprintf("Erase block %x,spare %x,offs %d\r\n",block_offs/65536,(block - NAND_END_BLOCK)/8,((block-NAND_END_BLOCK)%8)*512);
	rt_free(spare_buf);
	return RT_EOK;
}

static rt_err_t sst39vf_mtd_read(
		struct rt_mtd_nand_device * dev,
		rt_off_t page,
		rt_uint8_t * data, rt_uint32_t data_len, 
		rt_uint8_t * spare, rt_uint32_t spare_len)
{
	if (data != RT_NULL && data_len != 0)
	{	
	    // get offset of sst39vf's read position
		rt_uint32_t page_offs = (page-NAND_END_BLOCK*32)*512 + NOR_START_BLOCK*64*1024;
		if(data_len>512 && data_len<=528)
		{
            //read back both main data and spare data 
			rt_uint32_t spare_offs = (page-NAND_END_BLOCK*32)*16 + NOR_SPARE_BLOCK;
			rt_memcpy(data,(rt_uint8_t *)page_offs,512);
			rt_memcpy((rt_uint8_t *)(data+512),(rt_uint8_t *)spare_offs,data_len-512);
		}
		else
			rt_memcpy(data,(rt_uint8_t *)page_offs,data_len);
	}

	
	if (spare != RT_NULL && spare_len != 0)
	{
		rt_uint32_t spare_offs = (page-NAND_END_BLOCK*32)*16 + NOR_SPARE_BLOCK;
		rt_memcpy(spare,(rt_uint8_t *)spare_offs,spare_len);
	}	
	//rt_kprintf("Read block %x,sector %x ,spare %x\r\n",((page-NAND_END_BLOCK*32)*512 + NOR_START_BLOCK*64*1024)/65536,(page-NAND_END_BLOCK*32)%128,(page-NAND_END_BLOCK*32)*16 + NOR_SPARE_BLOCK);
	return RT_EOK;
}

static rt_err_t sst39vf_mtd_write (
		struct rt_mtd_nand_device * dev,
		rt_off_t page,
		const rt_uint8_t * data, rt_uint32_t data_len,
		const rt_uint8_t * spare, rt_uint32_t spare_len)
{
	if (data != RT_NULL && data_len != 0)
	{	
	    // get offset of sst39vf's write position
		rt_uint32_t page_offs = (page-NAND_END_BLOCK*32)*512 + NOR_START_BLOCK*64*1024;
		if(FlashProg(page_offs,(rt_uint16_t *)data,data_len/2)!=RT_EOK)
		{
			rt_kprintf("prog nor block %d ,page %x failed\n",page_offs/(32*512),(page-NAND_END_BLOCK*32)%32);
			return RT_ERROR;
		}
	}

	
