blueskycoco/rtt/bsp/stm32f40x/drivers/k9f1g08_mtd.c
	if (spare != RT_NULL && spare_len != 0)
	{
	    // get spare offset of sst39vf's write position
		rt_uint32_t spare_offs = (page-NAND_END_BLOCK*32)*16 + NOR_SPARE_BLOCK;
		if(FlashProg(spare_offs,(rt_uint16_t *)spare,spare_len/2)!=RT_EOK)
		{
			rt_kprintf("prog nor block spare %d ,page spare %x failed\n",spare_offs/(32*512),(page-NAND_END_BLOCK*32)%16);
			return RT_ERROR;
		}

	}
	
//	rt_kprintf("Write block %x,sector %x ,spare %x\r\n",((page-NAND_END_BLOCK*32)*512 + NOR_START_BLOCK*64*1024)/65536,(page-NAND_END_BLOCK*32)%128,(page-NAND_END_BLOCK*32)*16 + NOR_SPARE_BLOCK);
	return RT_EOK;
}

static rt_err_t sst39vf_read_id(
		struct rt_mtd_nand_device * dev)
{
    rt_uint32_t i;

    SWPIDEntry();
    i  = inportw(ROM_BASE);
    i |= inportw(ROM_BASE+2)<<16;
    SWPIDExit();
	rt_kprintf("sst39vf id %x\n",i);
    return RT_EOK;	
}
#endif
/*	add for nor flash 2012-12-11	*/
rt_uint32_t NF_DETECT_RB(void)
{
	rt_uint8_t stat;
	
	NF_CMD(CMD_STATUS);
	do {
		stat = NF_RDDATA();
		//printf("%x\n", stat);
	}while(!(stat&0x40));
	NF_CMD(CMD_READ);
	return stat&1;
}
/*
 * In a page, data's ecc code is stored in spare area, from BYTE 0 to BYTEE 3.
 * Block's status byte which indicate a block is bad or not is BYTE4.
 */
static void nand_hw_init(void)
{

	/* reset nand flash */
	NF_CE_L();
	NF_CMD(CMD_RESET);
	NF_DETECT_RB();
	NF_CE_H();
}

/*
 *check the first byte in spare of the block's first page
 *return
 * good block,  RT_EOK
 * bad  blcok, return -RT_ERROR
 */
static rt_err_t k9f2808_mtd_check_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	rt_uint8_t status;
	block =  block << 5;

	NF_CE_L();
	NF_CMD(CMD_READ2);
	NF_ADDR(BLOCK_MARK_SPARE_OFFSET);
	NF_ADDR(block & 0xff);
	NF_ADDR((block >> 8) & 0xff);
	NF_ADDR((block >> 16) & 0xff);

	NF_DETECT_RB();	 /* wait for ready bit */

	status = NF_RDDATA8();
	NF_CMD(CMD_READ);
	NF_CE_H();
	//rt_kprintf("k9f2808_mtd_check_block %d %x\n",block,status);
	/* TODO: more check about status */
	return status == 0xFF ? RT_EOK : -RT_ERROR;

}

static rt_err_t k9f2808_mtd_mark_bad_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	/* get address of the fisrt page in the block */
	rt_err_t result = RT_EOK;
	block =  block << 5;

	NF_CE_L();
	NF_CMD(CMD_READ2);
	NF_CMD(CMD_WRITE1);

	NF_ADDR(BLOCK_MARK_SPARE_OFFSET);
	NF_ADDR(block & 0xff);
	NF_ADDR((block >> 8) & 0xff);

	/* write bad block mark in spare*/
	NF_WRDATA8(0);

	NF_CMD(CMD_WRITE2);
 	NF_DETECT_RB();	     /* wait for ready bit */
	NF_CMD(CMD_STATUS);	/* get the status */

	if (NF_RDDATA() &  STATUS_ERROR)
		result = -RT_ERROR;
	NF_CMD(CMD_READ);
	NF_CE_H(); /* disable chip select */
	//rt_kprintf("k9f2808_mtd_mark_bad_block %d\n",block);
    return result;
}

static rt_err_t k9f2808_mtd_erase_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	/* 1 block = 64 page= 2^6*/
    	rt_err_t result = RT_EOK;
	block <<= 5; /* get the first page's address in this block*/

	NF_CE_L();  /* enable chip */
	
	NF_CMD(CMD_ERASE1);	/* erase one block 1st command */
	NF_ADDR(block & 0xff);
	NF_ADDR((block >> 8) & 0xff);
	NF_CMD(CMD_ERASE2);	

	NF_DETECT_RB(); /* wait for ready bit */

	NF_CMD(CMD_STATUS);	/* check status	*/

	if (NF_RDDATA() & STATUS_ERROR) {
		result = -RT_ERROR;
	}

	NF_CE_H();
	//rt_kprintf("k9f2808_mtd_erase_block %d\n",block);
	return result;

}

/* return 0, ecc ok, 1, can be fixed , -1 can not be fixed */
static rt_err_t k9f2808_mtd_read(
		struct rt_mtd_nand_device * dev,
		rt_off_t page,
		rt_uint8_t * data, rt_uint32_t data_len, //may not always be 2048
		rt_uint8_t * spare, rt_uint32_t spare_len)
{
	rt_uint32_t i;
 	rt_uint32_t mecc;
	rt_uint32_t status;
	rt_err_t result = RT_EOK;
	
	NF_CE_L();
	if (data != RT_NULL && data_len != 0)
	{
		/* read page data area */
		NF_CE_L();

		NF_CMD(CMD_READ);
		NF_ADDR(0);
		NF_ADDR((page) & 0xff);
		NF_ADDR((page >> 8) & 0xff);

		NF_DETECT_RB();/* wait for ready bit */

		/*TODO: use a more quick method */
		for (i = 0; i < data_len; i++)
			data[i] = NF_RDDATA8();

	}

	if (spare != RT_NULL && spare_len != 0)
	{
		/* read page spare area */

		NF_CMD(CMD_READ2);
		NF_ADDR(0);
		NF_ADDR((page) & 0xff);
		NF_ADDR((page >> 8) & 0xff);
		//NF_ADDR((page >> 16) & 0xff);

		NF_DETECT_RB();/* wait for ready bit */
		/*TODO: use a more quick method */
		for (i = 0; i < spare_len; i++)
			spare[i] = NF_RDDATA8();

		//NF_CMD(CMD_READ);
		result = RT_EOK;
	}
	NF_CE_H();
	//for(i=0;i<spare_len;i++)
	//rt_kprintf("k9f2808_mtd_read %d\n",spare[i]);
	/* TODO: more check about status */
	return result;
}

static rt_err_t k9f2808_mtd_write (
		struct rt_mtd_nand_device * dev,
		rt_off_t page,
		const rt_uint8_t * data, rt_uint32_t data_len,//will be 2048 always!
		const rt_uint8_t * spare, rt_uint32_t spare_len)
{
	rt_uint32_t i;
	rt_uint32_t mecc0;
	rt_err_t result = RT_EOK;

	NF_CE_L();       /* enable chip */
	if (data != RT_NULL && data_len != 0)
	{
		RT_ASSERT(data_len == PAGE_DATA_SIZE);
		NF_CMD(CMD_WRITE1);

		NF_ADDR(0);
		NF_ADDR( (page) & 0xff);
		NF_ADDR((page >> 8) & 0xff);

		for(i=0; i<PAGE_DATA_SIZE; i++)
			NF_WRDATA8(data[i]);


		NF_CMD(CMD_WRITE2);
		NF_DETECT_RB();	 	/* wait for ready bit */
	}

	if (spare != RT_NULL && spare_len != 0)
	{
		NF_CMD(CMD_READ2);
		NF_CMD(CMD_WRITE1);

		NF_ADDR(0);
		NF_ADDR( (page )& 0xff);
		NF_ADDR((page >> 8) & 0xff);

		for(i=0; i<spare_len; i++)
			NF_WRDATA8(spare[i]);

		NF_CMD(CMD_WRITE2);
		//NF_CMD(CMD_READ);
		NF_DETECT_RB();
	}

__ret:
	NF_CE_H(); /* disable chip */
	//for(i=0;i<spare_len;i++)
	//rt_kprintf("k9f2808_mtd_write %d\n",spare[i]);
	return result;
}

static rt_err_t k9f2808_read_id(
		struct rt_mtd_nand_device * dev)
{
	rt_uint32_t id;

	NF_CE_L();
	NF_CMD(CMD_READID);
	NF_ADDR(0);
	NF_WAITRB();
	id  = NF_RDDATA8()<<8;
	id |= NF_RDDATA8();
	NF_CE_H();
	rt_kprintf("K9F2808 ID %x\n",id);
	return RT_EOK;
}
#endif
static rt_err_t nand_mtd_check_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	rt_err_t result=RT_ERROR;
	rt_uint8_t status=0;
	rt_uint32_t addr=(block << 6);
	rt_mutex_take(&nand, RT_WAITING_FOREVER);
	*(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_1; 
	   
