blueskycoco/rtt/bsp/stm32f40x/drivers/k9f1g08_mtd.c
	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00; 
	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x08; 
	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(addr);  
	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(addr);

	*(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_TRUE; 

	while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );

	status= *(vu8 *)(Bank_NAND_ADDR);

	if(/*(NAND_READY==FSMC_NAND_GetStatus()) && (*/status == 0xff)
		result=RT_EOK;
	else
		rt_kprintf("check block %d ,%d\n",addr,status);
	rt_mutex_release(&nand);
	return result;
}

static rt_err_t nand_mtd_mark_bad_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	rt_err_t result=RT_ERROR;	
	rt_mutex_take(&nand, RT_WAITING_FOREVER);
	rt_uint32_t addr=(block << 6);
	/* Page write command and address */
    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM;

    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;  
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x08; 
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(addr);  
    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(addr);

    /* Write data */
    *(vu8 *)(Bank_NAND_ADDR | DATA_AREA) = 0x00;
    
    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM_TRUE;
    while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );
    
    /* Check status for successful operation */
    if(NAND_READY==FSMC_NAND_GetStatus())
		result=RT_EOK;
	//rt_kprintf("Mark block %d Bad\n",block);
	rt_mutex_release(&nand);
	return result;
}

static rt_err_t nand_mtd_erase_block(
		struct rt_mtd_nand_device* device,
		rt_uint32_t block)
{
	rt_err_t result=RT_ERROR;	
	rt_uint32_t addr=(block << 6);
	rt_mutex_take(&nand, RT_WAITING_FOREVER);
	*(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_ERASE0;

	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(addr);  
	*(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(addr);
		
	*(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_ERASE1; 

    while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );
	if(FSMC_NAND_GetStatus()==NAND_READY)
    	result=RT_EOK;
	//rt_kprintf("Erase block %d\n",addr);
	rt_mutex_release(&nand);
	return result;
}

static rt_err_t nand_mtd_read(
		struct rt_mtd_nand_device * dev,
		rt_off_t page,
		rt_uint8_t * data, rt_uint32_t data_len, //may not always be 2048
		rt_uint8_t * spare, rt_uint32_t spare_len)
{
	rt_err_t result=RT_ERROR;
	uint32_t index = 0x0000;
  	uint32_t status = NAND_READY;
	uint32_t size = 0;
	rt_mutex_take(&nand, RT_WAITING_FOREVER);
	if (data != RT_NULL && data_len != 0)
	{
		*(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_1; 
	   
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(page);  
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(page);

	    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_TRUE; 

	   	while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );

	    for(index = 0x0000; index < data_len; index++)
	    {
	      data[index]= *(vu8 *)(Bank_NAND_ADDR);
	    }
		status = FSMC_NAND_GetStatus();
	}
	if (spare != RT_NULL && spare_len != 0)
	{
		*(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_1; 
	   
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x08;
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(page);  
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(page);

	    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_READ_TRUE; 

	   	while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );

	    for(index = 0x0000; index < spare_len; index++)
	    {
	      spare[index]= *(vu8 *)(Bank_NAND_ADDR);
	    }
		status = FSMC_NAND_GetStatus();
	}
	rt_mutex_release(&nand);
	if(NAND_READY==status)
			result=RT_EOK;
	else
		rt_kprintf("nand_mtd_read page %d, %02x %d,%02x %d failed\n",page,data,data_len,spare,spare_len);

	return result;
}

static rt_err_t nand_mtd_write (
		struct rt_mtd_nand_device * dev,
		rt_off_t page,
		const rt_uint8_t * data, rt_uint32_t data_len,//will be 2048 always!
		const rt_uint8_t * spare, rt_uint32_t spare_len)
{	
	rt_err_t result=RT_ERROR;
	uint32_t index = 0x00;
   	uint32_t status = NAND_READY;
	rt_mutex_take(&nand, RT_WAITING_FOREVER);
	//rt_kprintf("nand write %02x %d,%02x %d\r\n",data,data_len,spare,spare_len);
	if(data != RT_NULL && data_len != 0 )
	{
		RT_ASSERT(data_len == NAND_PAGE_SIZE);
		/* Page write command and address */
	    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM;

	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;  
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00; 
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(page);  
	    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(page);

	    /* Write data */
	    for(index = 0x0000; index < data_len; index++)
	    {
	      *(vu8 *)(Bank_NAND_ADDR | DATA_AREA) = data[index];
	    }
	    if(spare==RT_NULL)
	    {
	    	*(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM_TRUE;
	    	//
	    	while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );
	    
	    	/* Check status for successful operation */
	    	status = FSMC_NAND_GetStatus();
	    }
	}    

	if(spare != RT_NULL && spare_len != 0)
	{
		if(data==RT_NULL)
		{
			/* Page write command and address */
		    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM;

		    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x00;  
		    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = 0x08; 
		    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_1st_CYCLE(page);  
		    *(vu8 *)(Bank_NAND_ADDR | ADDR_AREA) = ADDR_2nd_CYCLE(page);
		}
	    /* Write data */
	    for(index = 0x0000; index < spare_len; index++)
	    {
	      *(vu8 *)(Bank_NAND_ADDR | DATA_AREA) = spare[index];
	    }
		
	    *(vu8 *)(Bank_NAND_ADDR | CMD_AREA) = NAND_CMD_PAGEPROGRAM_TRUE;
	    //
	    while( GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_6) == 0 );
	    
	    /* Check status for successful operation */
	    status = FSMC_NAND_GetStatus();
	}
	rt_mutex_release(&nand);
	if(NAND_READY==status)
		result=RT_EOK;
	else
		rt_kprintf("nand_mtd_write page %d, %02x %d,%02x %d failed\n",page,data,data_len,spare,spare_len);
	return result;
}

static rt_err_t nand_read_id(
		struct rt_mtd_nand_device * dev)
{
	NAND_IDTypeDef NAND_ID;
	NAND_ReadID(&NAND_ID);
    return RT_EOK;	
}

const static struct rt_mtd_nand_driver_ops nand_mtd_ops =
{
	nand_read_id,
	nand_mtd_read,
	nand_mtd_write,
	RT_NULL,
	nand_mtd_erase_block,
	nand_mtd_check_block,
	nand_mtd_mark_bad_block,
};

/* interface of nand and rt-thread device */
static struct rt_mtd_nand_device nand_part;

void k9f2808_mtd_init()
{
	/* the first partition of nand */
	nand_part.page_size = NAND_PAGE_SIZE;
	nand_part.pages_per_block = NAND_BLOCK_SIZE;//don't caculate oob size
	nand_part.block_start = 0;
	nand_part.block_end = NAND_ZONE_SIZE;
	nand_part.oob_size = 64;
	nand_part.ops = &nand_mtd_ops;
	rt_mtd_nand_register_device("nand0", &nand_part);
}
void nand_mtd_init()
{
	NAND_IDTypeDef NAND_ID;
	#define NAND_HY_MakerID    0XEC
	#define NAND_HY_DeviceID   0XF1
	rt_uint8_t spare[64],spare1[64],*data,*data1;
	int i;
	NAND_Init();

	NAND_ReadID(&NAND_ID);
	rt_kprintf("\nNand Flash ID:0x%02x 0x%02x 0x%02x 0x%02x \n",NAND_ID.Maker_ID,NAND_ID.Device_ID, NAND_ID.Third_ID,NAND_ID.Fourth_ID);

    /* initialize mutex */
	if (rt_mutex_init(&nand, "nand", RT_IPC_FLAG_FIFO) != RT_EOK)
	{
		rt_kprintf("init nand lock mutex failed\n");
	}

	k9f2808_mtd_init();

