blueskycoco/rtt/bsp/stm32f40x/drivers/k9f1g08_mtd.c
	#if 0
	data=(rt_uint8_t *)rt_malloc(2048);
	data1=(rt_uint8_t *)rt_malloc(2048);
	rt_memset(spare1,0,64);
	if(data1!=RT_NULL)
	rt_memset(data1,0,2048);
	rt_kprintf("==Data>\n");
	for(i=0;i<2048;i++)
	{
		data[i]=255-i%255;
		rt_kprintf("%02x ",data[i]);
	}	
	rt_kprintf("\n==Spare>\n");
	for(i=0;i<64;i++)
	{
		spare[i]=i;
		rt_kprintf("%d ",spare[i]);
	}
	//NAND_Reset();
	nand_mtd_erase_block(RT_NULL,0);
	nand_mtd_write(RT_NULL,0,data,2048,spare,64);
	nand_mtd_read(RT_NULL,0,data1,2048,spare1,64);
	rt_kprintf("\n<Data==\n");
	for(i=0;i<2048;i++)
	{
		rt_kprintf("%02x ",data1[i]);
	}
	rt_kprintf("\n<Spare==\n");
	for(i=0;i<64;i++)
	{
		rt_kprintf("%d ",spare1[i]);
	}
	#endif
}
#if 0
#include "finsh.h"
static char buf[PAGE_DATA_SIZE+16];
static char buf1[PAGE_DATA_SIZE+16];
static char spare[16];
static char spare1[16];
static int flag;
void nand_erase(int start, int end)
{
	int page;
	flag=1;
	rt_memset(buf, 0, PAGE_DATA_SIZE);
	rt_memset(spare, 0, 16);
	for(; start <= end; start ++)
	{
		page = start * 32;
		nand_mtd_erase_block(RT_NULL, start);
		nand_mtd_read(RT_NULL, page, buf, PAGE_DATA_SIZE, spare, 16);
		if (spare[0] != 0xFF)
		{
			rt_kprintf("block %d is bad, mark it bad\n", start);
			if (spare[4] == 0xFF)
			{
				spare[4] = 0x00;
				nand_mtd_write(RT_NULL, page, RT_NULL, 0, spare, 16);
			}
		}
	}
}

int nand_read(int start,int end)
{
	int i,page,j;
	int res;
	rt_memset(buf, 0, sizeof(buf));
	for(; start <= end; start ++)
	{
        for(j=0;j<32;j++)
        {
			page = start * 32+j;
			res = nand_mtd_read(RT_NULL, page, buf, PAGE_DATA_SIZE+16, RT_NULL, 0);
			for(i=0; i<PAGE_DATA_SIZE; i++)
			{
				if(flag==0)
				{
					if(buf[i]!=buf1[i])
					rt_kprintf("nand_read block %d ,page %d ,buf[%2d] %d != %d	\n",page/32,page%32,i,buf[i],buf1[i]);
				}else
				{
					if(buf[i]!=0xff)
					rt_kprintf("nand_read block %d ,page %d ,i %d is not correct\n",page/32,page%32,i);			
				}
			}

			for(i=0; i<16; i++)
			{
				if(flag==0)
				{
					if(buf[512+i]!=spare1[i])
					rt_kprintf("nand_read block %d ,page %d ,spare[%2d] %d!=%d n",page/32,page%32,i,buf[512+i],spare1[i]);
				}else
				{
					if(buf[512+i]!=0xff)
					rt_kprintf("nand_read block %d ,page %d ,spare %d is not correct\n",page/32,page%32,i);			
				}
			
		    }
        }
	}
	return res;
}
int nand_write(int start,int end)
{
	int i;
	rt_err_t result=RT_EOK;
	rt_memset(buf, 0, PAGE_DATA_SIZE);
	rt_memset(spare, 0, 16);
	for(i=0; i<PAGE_DATA_SIZE; i++)
	{
		buf[i] = (i % 2) + i / 2;
		buf1[i] = buf[i];
	}
	for(i=0;i<16;i++)
	{
		spare[i]=i;
		spare1[i]=i;
	}
	flag=0;
	for(;start<=end;start++)		
	  for(i=0;i<32;i++)
		{
			result = nand_mtd_write(RT_NULL, start*32+i, buf, PAGE_DATA_SIZE, spare, 16);
			if(result!=RT_EOK)
			{
				rt_kprintf("nand_mtd_write block %d,page %d filed\n",start,start*32+i);
			}
	  	}
	return	result;
}

int nand_read2(int start,int end)
{
	int i,page,j;
	int res;
	rt_memset(buf, 0, sizeof(buf));		
	rt_memset(spare, 0, 16);
	for(; start <= end; start ++)
	{
        for(j=0;j<32;j++)
        {
			page = start * 32+j;
			res = nand_mtd_read(RT_NULL, page, buf, PAGE_DATA_SIZE, RT_NULL, 0);
			for(i=0; i<PAGE_DATA_SIZE; i++)
			{
				if(flag==0)
				{
					if(buf[i]!=buf1[i])
					rt_kprintf("nand_read2 block %d ,page %d ,buf[%2d] %d != %d \n",page/32,page%32,i,buf[i],buf1[i]);
				}else
				{
					if(buf[i]!=0xff)
					rt_kprintf("nand_read2 block %d ,page %d ,i %d is not correct\n",page/32,page%32,i);			
				}
			}


			res = nand_mtd_read(RT_NULL, page, RT_NULL, 0, spare, 16);
			for(i=0; i<16; i++)
			{
				if(flag==0)
				{
					if(spare[i]!=spare1[i])
					rt_kprintf("nand_read2 block %d ,page %d ,spare[%2d] %d != %d \n",page/32,page%32,i,spare[i],spare1[i]);
				}else
				{
					if(spare[i]!=0xff)
					rt_kprintf("nand_read2 block %d ,page %d ,spare %d is not correct\n",page/32,page%32,i);			
				}
			}
        }
	}
	return res;
}
int nand_read3(int start, int end)
{
	int i,page,j;
	int res;
	rt_memset(buf, 0, sizeof(buf));
	rt_memset(spare, 0, 16);
	for(; start <= end; start ++)
	{
        for(j=0;j<32;j++)
        {
			page = start * 32+j;
			res = nand_mtd_read(RT_NULL, page, buf, PAGE_DATA_SIZE, spare, 16);
			for(i=0; i<PAGE_DATA_SIZE; i++)
			{
				if(flag==0)
				{
					if(buf[i]!=buf1[i])
					rt_kprintf("nand_read3 block %d ,page %d ,buf[%2d] %d != %d\n",page/32,page%32,i,buf[i],buf1[i]);
				}else
				{
					if(buf[i]!=0xff)
					rt_kprintf("nand_read3 block %d ,page %d ,i %d is not correct\n",page/32,page%32,i);			
				}
			}

			for(i=0; i<16; i++)
			{
				if(flag==0)
				{
					if(spare[i]!=spare1[i])
					rt_kprintf("nand_read3 block %d ,page %d ,spare[%2d] %d !=%d \n",page/32,page%32,i,spare[i],spare1[i]);
				}else
				{
					if(spare[i]!=0xff)
					rt_kprintf("nand_read3 block %d ,page %d ,spare %d is not correct\n",page/32,page%32,i);			
				}
			}
        }
	
	}
	return res;
}
void nand_read_total(int start, int end)
{

	nand_read(start,end);
	nand_read2(start,end);
	nand_read3(start,end);
}
int nand_check(int start, int end)
{
	for(; start <= end; start ++)
	{
		if ( nand_mtd_check_block(RT_NULL, start) != RT_EOK)
			rt_kprintf("block %d is bad\n", start);
	}
}

int nand_mark(int start,int end)
{
	rt_err_t result;
	for(; start <= end; start ++)
	{
		result = nand_mtd_mark_bad_block(RT_NULL, start);
		if(result !=RT_EOK)
			rt_kprintf("nand_mark %d block failed",start);
	}
}
void nand_id(void)
{
	nand_read_id(NULL);
}
void nand_test_erase(void)
{
	nand_erase(0,1105);
	rt_kprintf("total block are erased \n");
	nand_read_total(0,1105);
	rt_kprintf("total block are readed \n");
}
void nand_test_write(void)
{
	nand_erase(0,1105);
	rt_kprintf("total block are erased \n");
	nand_write(0,1105);
	rt_kprintf("total block are writed \n");
	nand_read_total(0,1105);
	rt_kprintf("total block are readed \n");
}
FINSH_FUNCTION_EXPORT(nand_id, nand_read_id);
FINSH_FUNCTION_EXPORT(nand_read, nand_read(0,1105).);
FINSH_FUNCTION_EXPORT(nand_read2, nand_read2(0,1105).);
FINSH_FUNCTION_EXPORT(nand_read3, nand_read3(0,1105).);
FINSH_FUNCTION_EXPORT(nand_read_total, nand_read_total(0,1105).);
FINSH_FUNCTION_EXPORT(nand_write, nand_write(0,1105).);
FINSH_FUNCTION_EXPORT(nand_check, nand_check(0,1105).);
FINSH_FUNCTION_EXPORT(nand_mark, nand_mark(0,1105).);
FINSH_FUNCTION_EXPORT(nand_test_erase, nand_test_erase().);
FINSH_FUNCTION_EXPORT(nand_test_write, nand_test_write().);
FINSH_FUNCTION_EXPORT(nand_erase, nand_erase(0, 1105). erase block in nand);
#endif
#endif
